using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace PracticWork
{
    class Program
    {
        static void Main(string[] args)
        {
            //1.вычисления значения функции y = 7x ^ 2 - 3x + 4 
            //при любом значении x;
            //int x;
            //int y;
            //x = Convert.ToInt32(Console.ReadLine());
            //y=Convert.ToInt32((7 * Math.Pow(x, 2)) - (3 * x) + 4);
            //Console.WriteLine(y);

            //2.Дан радиус окружности. Найти длину 
            //окружности и площадь круга.
            //const float pi = 3.14f;
            //float R;
            //float S;
            //float L;
            //Console.WriteLine("Введите радиус окружности");
            //R = float.Parse(Console.ReadLine());
            //L = 2 * pi * R;
            //S = pi * R * R;
            //Console.WriteLine("Площадь круга равна "+S+" Длина окружности равна "+L);
            //Console.ReadKey();

            //3.Дано расстояние в сантиметрах.
            //Найти число полных метров в нем

            //int Santim;
            //Console.WriteLine("Введите число в сантиметрах что бы получить число полных метров в нем!");
            //Santim = Convert.ToInt32(Console.ReadLine());
            //Santim /= 100;
            //Console.WriteLine("Число полных метров = "+Santim+"\n");

            //4.С некоторого момента прошло 234 дня.
            //Сколько полных недель прошло за этот период ?

            //Console.WriteLine("C некоторого дня прошло 234 дня!");
            //int Day = 234;
            //int Nedely = 7;
            //int Week;
            //Week = Day / Nedely;
            //Console.WriteLine("Кол-во полных недель = "+Week+" !");

            //5.Дано двузначное число.Найти:
            //a.число десятков в нем;
            //b.число единиц в нем;
            //c.сумму его цифр;
            //d.произведение его цифр

            //Console.WriteLine("Введите двузначное число! ");
            //int Chislo;
            //int A,B,C,D;
            //Chislo = Convert.ToInt32(Console.ReadLine());
            //A = Chislo;
            //A /= 10;
            //Console.WriteLine("Кол-во десятков в нем = "+A);
            //B = Chislo;
            //Console.WriteLine("Кол-во едениц в нем = " + B);           
            //C=B%10+A;
            //Console.WriteLine("Сумма его цифр = "+C);
            //D =B % 10 * A;
            //Console.WriteLine("Произведение его цифр = " + D);

            //6.Дано четырехзначное число. Найти:
            //a.сумму его цифр;
            //b.произведение его цифр.

            //Console.WriteLine("Введите четырехзначное число! ");
            //int Chislo;
            //int A=0;
            //int B = 0;
            //Chislo = Convert.ToInt32(Console.ReadLine());
            //while (Chislo >= 10)
            //{
            //    A += Chislo % 10;
            //    Chislo /= 10;
            //}
            //A += Chislo;
            //B = Chislo % 10 * A;
            //Console.WriteLine("Сумма его цифр = " + A);
            //Console.WriteLine("Произведение его цифр = " + B);

            //7.В трехзначном числе x зачеркнули его вторую цифру.
            //Когда к образованному при этом двузначному числу справа приписали вторую 
            //цифру числа x, то получилось число 456.Найти число x.

            //8.Вычислить значение логического выражения при всех 
            //возможных значениях логических величин X и Y:
            //a.не X и не Y;
            //b.X или(не X и Y);
            //c.  (не X и Y) или Y.

            //bool X = true;
            //bool Y = false;
            
            //Console.WriteLine(!X && !Y);
            //Console.WriteLine(X||!X && Y);
            //Console.WriteLine(!X && Y||Y);


        }
    }
}
